application/backend/models/SiteConfigService.php

	public function getConfig($siteID)
	{
        $cacheName = sprintf(self::CONFIG_CACHE, $siteID);
        $model = Yii::$app->cache->get($cacheName);
        if($model === false)
        {
            $model = SiteConfig::findOne($siteID);
---
SELECT * FROM `dsk_siteconfig` WHERE `siteID`=1