application/common/models/User.php

SELECT * FROM `dsk_users` WHERE (`userID`=1) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['userID' => $id, 'status' => self::STATUS_ACTIVE]);